---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.SphericalLightDistribution
source: html/1dab005b-b796-bbef-3747-c9444e35b18f.htm
---
# SphericalLightDistribution Properties

Specifies whether the .NET object represents a valid Revit entity.